zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_cm33.h
/**
  ******************************************************************************
  * @file    stm32mp211dxx_cm33.h
  * @author  MCD Application Team
  * @brief   CMSIS stm32mp211dxx_cm33 Device Peripheral Access Layer Header File.
  *
  *          This file contains:
  *           - Data structures and the address mapping for all peripherals
  *           - Peripheral registers declarations and bits definition
  *           - Macros to access peripherals registers hardware
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2022 STMicroelectronics</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */

/** @addtogroup CMSIS_Device
  * @{
  */

/** @addtogroup stm32mp211dxx_cm33
  * @{
  */

#ifndef __STM32MP211Dxx_CM33_H
#define __STM32MP211Dxx_CM33_H

#ifdef __cplusplus
 extern "C" {
#endif /* __cplusplus */

/** @addtogroup Peripheral_interrupt_number_definition
  * @{
  */


 /**
 * @brief stm32mp2_m33 Interrupt Number Definition :
 *        - according to the selected device in @ref Library_configuration_section
 *        - according to "Table 187. interrupt mapping for Cortex-M33"
 *          in chapitre 26 "interrupt list" of reference document
 *          RM0506 - Reference Manual - STM32MP21xx - advanced ARM-based 32/64-bit MPUs
 */
 typedef enum
  {
  /******  Cortex-M Processor Exceptions Numbers ***********************************************/
    NonMaskableInt_IRQn         = -14,   /*!< 2 Non Maskable Interrupt                          */
    HardFault_IRQn              = -13,   /*!< 3 Cortex-M Hard Fault Interrupt                   */
    MemoryManagement_IRQn       = -12,   /*!< 4 Cortex-M Memory Management Interrupt            */
    BusFault_IRQn               = -11,   /*!< 5 Cortex-M Bus Fault Interrupt                    */
    UsageFault_IRQn             = -10,   /*!< 6 Cortex-M Usage Fault Interrupt                  */
    SecureFault_IRQn            = -9,    /*!< 7 Cortex-M Secure Fault Interrupt                 */
    SVCall_IRQn                 = -5,    /*!< 11 Cortex-M SV Call Interrupt                     */
    DebugMonitor_IRQn           = -4,    /*!< 12 Cortex-M Debug Monitor Interrupt               */
    PendSV_IRQn                 = -2,    /*!< 14 Cortex-M Pend SV Interrupt                     */
    SysTick_IRQn                = -1,    /*!< 15 Cortex-M System Tick Interrupt                 */
  /******  STM32 specific Interrupt Numbers ****************************************************/
    PVD_IRQn                    = 0,     /*!< PVD detector through EXTI                        */
    PVM_IRQn                    = 1,     /*!< PVM detector through EXTI                        */
    IWDG3_IRQn                  = 2,     /*!< Independent Watchdog 3  Early wake interrupt     */
    IWDG4_IRQn                  = 3,     /*!< Independent Watchdog 4  Early wake interrupt     */
    IWDG1_RST_IRQn              = 4,     /*!< Independent Watchdog 1 Reset through EXTI        */
    IWDG2_RST_IRQn              = 5,     /*!< Independent Watchdog 2 Reset through EXTI        */
    IWDG4_RST_IRQn              = 6,     /*!< Independent Watchdog 4 Reset through EXTI        */
    WWDG1_IRQn                  = 7,     /*!< Window Watchdog 1 Early Wakeup interrupt         */
    RESERVED_8                  = 8,     /*!< reserved                                         */
    RESERVED_9                  = 9,     /*!< reserved                                         */
    TAMP_IRQn                   = 10,     /*!< Tamper interrupt (include LSECSS interrupts)    */
    RTC_IRQn                    = 11,     /*!< RTC global  interrupt                           */
    TAMP_S_IRQn                 = 12,     /*!< Tamper secure  interrupt (include LSECSS interrupts)*/
    RTC_S_IRQn                  = 13,     /*!< RTC global secure  interrupt                    */
    RCC_IRQn                    = 14,     /*!< RCC global interrupt                            */
    EXTI2_0_IRQn                = 15,     /*!< EXTI2 Line 0 interrupt                          */
    EXTI2_1_IRQn                = 16,     /*!< EXTI2 Line 1 interrupt                          */
    EXTI2_2_IRQn                = 17,     /*!< EXTI2 Line 2 interrupt                          */
    EXTI2_3_IRQn                = 18,     /*!< EXTI2 Line 3 interrupt                          */
    EXTI2_4_IRQn                = 19,     /*!< EXTI2 Line 4 interrupt                          */
    EXTI2_5_IRQn                = 20,     /*!< EXTI2 Line 5 interrupt                          */
    EXTI2_6_IRQn                = 21,     /*!< EXTI2 Line 6 interrupt                          */
    EXTI2_7_IRQn                = 22,     /*!< EXTI2 Line 7 interrupt                          */
    EXTI2_8_IRQn                = 23,     /*!< EXTI2 Line 8 interrupt                          */
    EXTI2_9_IRQn                = 24,     /*!< EXTI2 Line 9 interrupt                          */
    EXTI2_10_IRQn               = 25,     /*!< EXTI2 Line 10 interrupt                         */
    EXTI2_11_IRQn               = 26,     /*!< EXTI2 Line 11 interrupt                         */
    EXTI2_12_IRQn               = 27,     /*!< EXTI2 Line 12 interrupt                         */
    EXTI2_13_IRQn               = 28,     /*!< EXTI2 Line 13 interrupt                         */
    EXTI2_14_IRQn               = 29,     /*!< EXTI2 Line 14 interrupt                         */
    EXTI2_15_IRQn               = 30,     /*!< EXTI2 Line 15 interrupt                         */
    HPDMA1_Channel0_IRQn        = 31,     /*!< HPDMA1 Channel0 interrupt                       */
    HPDMA1_Channel1_IRQn        = 32,     /*!< HPDMA1 Channel1 interrupt                       */
    HPDMA1_Channel2_IRQn        = 33,     /*!< HPDMA1 Channel2 interrupt                       */
    HPDMA1_Channel3_IRQn        = 34,     /*!< HPDMA1 Channel3 interrupt                       */
    HPDMA1_Channel4_IRQn        = 35,     /*!< HPDMA1 Channel4 interrupt                       */
    HPDMA1_Channel5_IRQn        = 36,     /*!< HPDMA1 Channel5 interrupt                       */
    HPDMA1_Channel6_IRQn        = 37,     /*!< HPDMA1 Channel6 interrupt                       */
    HPDMA1_Channel7_IRQn        = 38,     /*!< HPDMA1 Channel7 interrupt                       */
    HPDMA1_Channel8_IRQn        = 39,     /*!< HPDMA1 Channel8 interrupt                       */
    HPDMA1_Channel9_IRQn        = 40,     /*!< HPDMA1 Channel9 interrupt                       */
    HPDMA1_Channel10_IRQn       = 41,     /*!< HPDMA1 Channel10 interrupt                      */
    HPDMA1_Channel11_IRQn       = 42,     /*!< HPDMA1 Channel11 interrupt                      */
    HPDMA1_Channel12_IRQn       = 43,     /*!< HPDMA1 Channel12 interrupt                      */
    HPDMA1_Channel13_IRQn       = 44,     /*!< HPDMA1 Channel13 interrupt                      */
    HPDMA1_Channel14_IRQn       = 45,     /*!< HPDMA1 Channel14 interrupt                      */
    HPDMA1_Channel15_IRQn       = 46,     /*!< HPDMA1 Channel15 interrupt                      */
    HPDMA2_Channel0_IRQn        = 47,     /*!< HPDMA2 Channel0 interrupt                       */
    HPDMA2_Channel1_IRQn        = 48,     /*!< HPDMA2 Channel1 interrupt                       */
    HPDMA2_Channel2_IRQn        = 49,     /*!< HPDMA2 Channel2 interrupt                       */
    HPDMA2_Channel3_IRQn        = 50,     /*!< HPDMA2 Channel3 interrupt                       */
    HPDMA2_Channel4_IRQn        = 51,     /*!< HPDMA2 Channel4 interrupt                       */
    HPDMA2_Channel5_IRQn        = 52,     /*!< HPDMA2 Channel5 interrupt                       */
    HPDMA2_Channel6_IRQn        = 53,     /*!< HPDMA2 Channel6 interrupt                       */
    HPDMA2_Channel7_IRQn        = 54,     /*!< HPDMA2 Channel7 interrupt                       */
    HPDMA2_Channel8_IRQn        = 55,     /*!< HPDMA2 Channel8 interrupt                       */
    HPDMA2_Channel9_IRQn        = 56,     /*!< HPDMA2 Channel9 interrupt                       */
    HPDMA2_Channel10_IRQn       = 57,     /*!< HPDMA2 Channel10 interrupt                      */
    HPDMA2_Channel11_IRQn       = 58,     /*!< HPDMA2 Channel11 interrupt                      */
    HPDMA2_Channel12_IRQn       = 59,     /*!< HPDMA2 Channel12 interrupt                      */
    HPDMA2_Channel13_IRQn       = 60,     /*!< HPDMA2 Channel13 interrupt                      */
    HPDMA2_Channel14_IRQn       = 61,     /*!< HPDMA2 Channel14 interrupt                      */
    HPDMA2_Channel15_IRQn       = 62,     /*!< HPDMA2 Channel15 interrupt                      */
    HPDMA3_Channel0_IRQn        = 63,     /*!< HPDMA3 Channel0 interrupt                       */
    HPDMA3_Channel1_IRQn        = 64,     /*!< HPDMA3 Channel1 interrupt                       */
    HPDMA3_Channel2_IRQn        = 65,     /*!< HPDMA3 Channel2 interrupt                       */
    HPDMA3_Channel3_IRQn        = 66,     /*!< HPDMA3 Channel3 interrupt                       */
    HPDMA3_Channel4_IRQn        = 67,     /*!< HPDMA3 Channel4 interrupt                       */
    HPDMA3_Channel5_IRQn        = 68,     /*!< HPDMA3 Channel5 interrupt                       */
    HPDMA3_Channel6_IRQn        = 69,     /*!< HPDMA3 Channel6 interrupt                       */
    HPDMA3_Channel7_IRQn        = 70,     /*!< HPDMA3 Channel7 interrupt                       */
    HPDMA3_Channel8_IRQn        = 71,     /*!< HPDMA3 Channel8 interrupt                       */
    HPDMA3_Channel9_IRQn        = 72,     /*!< HPDMA3 Channel9 interrupt                       */
    HPDMA3_Channel10_IRQn       = 73,     /*!< HPDMA3 Channel10 interrupt                      */
    HPDMA3_Channel11_IRQn       = 74,     /*!< HPDMA3 Channel11 interrupt                      */
    HPDMA3_Channel12_IRQn       = 75,     /*!< HPDMA3 Channel12 interrupt                      */
    HPDMA3_Channel13_IRQn       = 76,     /*!< HPDMA3 Channel13 interrupt                      */
    HPDMA3_Channel14_IRQn       = 77,     /*!< HPDMA3 Channel14 interrupt                      */
    HPDMA3_Channel15_IRQn       = 78,     /*!< HPDMA3 Channel15 interrupt                      */
    ICACHE_IRQn                 = 79,     /*!< ICACHE interrupt                                */
    DCACHE_IRQn                 = 80,     /*!< DCACHE interrupt                                */
    ADC1_IRQn                   = 81,     /*!< ADC1 interrupt                                  */
    ADC2_IRQn                   = 82,     /*!< ADC2  interrupt                                 */
   RESERVED_83                  = 83,     /*!< reserved                                          */
   RESERVED_84                  = 84,     /*!< reserved                                          */
   RESERVED_85                  = 85,     /*!< reserved                                          */
   RESERVED_86                  = 86,     /*!< reserved                                          */
   RESERVED_87                  = 87,     /*!< reserved                                          */
    TIM1_BRK_IRQn               = 88,     /*!< TIM1 Break interrupt                            */
    TIM1_UP_IRQn                = 89,     /*!< TIM1 Update interrupt                           */
    TIM1_TRG_COM_IRQn           = 90,     /*!< TIM1 Trigger and Commutation interrupts         */
    TIM1_CC_IRQn                = 91,     /*!< TIM1 Capture Compare interrupt                  */
    TIM2_IRQn                   = 92,     /*!< TIM2 global interrupt                           */
    TIM3_IRQn                   = 93,     /*!< TIM3 global interrupt                           */
    TIM4_IRQn                   = 94,     /*!< TIM4 global interrupt                           */
    I2C1_IRQn                   = 95,     /*!< I2C1 Global interrupt                           */
    I3C1_IRQn                   = 96,     /*!< I3C1 Global interrupt                           */
    I2C2_IRQn                   = 97,     /*!< I2C2 Global interrupt                           */
    I3C2_IRQn                   = 98,     /*!< I3C2 Global interrupt                           */
    SPI1_IRQn                   = 99,     /*!< SPI1 global interrupt                           */
    SPI2_IRQn                   = 100,    /*!< SPI2 global interrupt                          */
    USART1_IRQn                 = 101,    /*!< USART1 global interrupt                        */
    USART2_IRQn                 = 102,    /*!< USART2 global interrupt                        */
    USART3_IRQn                 = 103,    /*!< USART3 global interrupt                        */
   RESERVED_104                 = 104,     /*!< reserved                                          */
    TIM8_BRK_IRQn               = 105,     /*!< TIM8 Break interrupt                           */
    TIM8_UP_IRQn                = 106,     /*!< TIM8 Update interrupt                          */
    TIM8_TRG_COM_IRQn           = 107,     /*!< TIM8 Trigger & Commutation interrupt           */
    TIM8_CC_IRQn                = 108,     /*!< TIM8 Capture Compare interrupt                 */
    FMC_IRQn                    = 109,     /*!< FMC Global interrupt                           */
    SDMMC1_IRQn                 = 110,     /*!< SDMMC1 Global interrupt                        */
    TIM5_IRQn                   = 111,     /*!< TIM5 Global interrupt                          */
    SPI3_IRQn                   = 112,     /*!< SPI3 Global interrupt                          */
    UART4_IRQn                  = 113,     /*!< UART4 global interrupt                         */
    UART5_IRQn                  = 114,     /*!< UART5 global interrupt                         */
    TIM6_IRQn                   = 115,     /*!< TIM6 global interrupt                          */
    TIM7_IRQn                   = 116,     /*!< TIM7 global interrupt                          */
    ETH1_SBD_IRQn               = 117,     /*!< ETH1 global interrupt                          */
    ETH1_PMT_IRQn               = 118,     /*!< ETH1 Wkup interrupt (PMT)                      */
    ETH1_LPI_IRQn               = 119,     /*!< ETH1 LPI interrupt                             */
   RESERVED_120                 = 120,     /*!< reserved                                          */
   RESERVED_121                 = 121,     /*!< reserved                                          */
   RESERVED_122                 = 122,     /*!< reserved                                          */
    USART6_IRQn                 = 123,     /*!< USART6 global interrupt                        */
    I2C3_IRQn                   = 124,     /*!< I2C3 Global interrupt                          */
    I3C3_IRQn                   = 125,     /*!< I3C3  Global interrupt                         */
    USBH_EHCI_IRQn              = 126,     /*!< USB Host EHCI Interrupt                        */
    USBH_OHCI_IRQn              = 127,     /*!< USB Host OHCI Interrupt                        */
    DCMI_PSSI_IRQn              = 128,     /*!< DCMI & PSSI global interrupt                   */
   RESERVED_129                 = 129,     /*!< reserved                                       */
    RESERVED_130                = 130,     /*!< reserved                                       */
    RESERVED_131                = 131,     /*!< reserved                                       */
    HASH1_IRQn                  = 132,     /*!< Hash1  interrupt                               */
    RESERVED_133                = 133,     /*!< reserved                                       */
    FPU_IRQn                    = 134,     /*!< FPU global interrupt                           */
    UART7_IRQn                  = 135,     /*!< UART7 global interrupt                         */
    LPUART1_IRQn                = 136,     /*!< LPUART1 global interrupt                       */
    SPI4_IRQn                   = 137,     /*!< SPI4 global interrupt                          */
    SPI5_IRQn                   = 138,     /*!< SPI5 global interrupt                          */
    SPI6_IRQn                   = 139,     /*!< SPI6 global interrupt                          */
    SAI1_IRQn                   = 140,     /*!< SAI1 global interrupt                          */
    LTDC_IRQn                   = 141,     /*!< LTDC global interrupt                          */
    LTDC_ER_IRQn                = 142,     /*!< LTDC global error interrupt                    */
    LTDC_SEC_IRQn               = 143,     /*!< LTDC security global interrupt                 */
    LTDC_SEC_ER_IRQn            = 144,     /*!< LTDC security global error interrupt           */
    SAI2_IRQn                   = 145,     /*!< SAI2 global interrupt                          */
    OCTOSPI1_IRQn               = 146,     /*!< OCTOSPI1 global interrupt                      */
    RESERVED_147                = 147,     /*!< reserved                                       */
    RESERVED_148                = 148,     /*!< reserved                                          */
    LPTIM1_IRQn                 = 149,     /*!< LPTIMER1 global interrupt                      */
    USBH_WAKEUP_IRQn            = 150,     /*!< USBH Remote  Wake up from USB2PHY1             */
    SPDIFRX_IRQn                = 151,     /*!< SPDIFRX global interrupt                       */
    IPCC1_RX_IRQn               = 152,     /*!< Mailbox 1 RX Occupied interrupt                */
    IPCC1_TX_IRQn               = 153,     /*!< Mailbox 1 TX Free  interrupt                   */
    IPCC1_RX_S_IRQn             = 154,     /*!< Mailbox 1 RX Occupied  secure interrupt        */
    IPCC1_TX_S_IRQn             = 155,     /*!< Mailbox 1 TX Free  secure interrupt            */
    RESERVED_156                = 156,     /*!< reserved                                          */
    RESERVED_157                = 157,     /*!< reserved                                          */
    OTG_WAKEUP_IRQn             = 158,     /*!< USB2 DR Remote  Wake up from USB2PHY2          */
    RESERVED_159                = 159,     /*!< reserved                                          */
    MDF1_FLT0_IRQn              = 160,     /*!< MDF1 Filter0 Interrupt                         */
    MDF1_FLT1_IRQn              = 161,     /*!< MDF1 Filter1 Interrupt                         */
    MDF1_FLT2_IRQn              = 162,     /*!< MDF1 Filter2 Interrupt                         */
    MDF1_FLT3_IRQn              = 163,     /*!< MDF1 Filter3 Interrupt                         */
    SAI3_IRQn                   = 164,     /*!< SAI3 global interrupt                          */
    TIM15_IRQn                  = 165,     /*!< TIM15 global interrupt                         */
    TIM16_IRQn                  = 166,     /*!< TIM16 global interrupt                         */
    TIM17_IRQn                  = 167,     /*!< TIM17 global interrupt                         */
    TIM12_IRQn                  = 168,     /*!< TIM12 global interrupt                         */
    SDMMC2_IRQn                 = 169,     /*!< SDMMC2 global interrupt                        */
    DCMIPP_IRQn                 = 170,     /*!< DCMIPP global interrupt                        */
    nCTIIRQ1_IRQn               = 171,     /*!< Cortex-M33 CTI interrupt 1                     */
    nCTIIRQ2_IRQn               = 172,     /*!< Cortex-M33 CTI interrupt 2                     */
    TIM13_IRQn                  = 173,     /*!< TIM13 global interrupt                         */
    TIM14_IRQn                  = 174,     /*!< TIM14 global interrupt                         */
    TIM10_IRQn                  = 175,     /*!< TIM10 global interrupt                         */
    RNG1_IRQn                   = 176,     /*!< RNG1 interrupt                                 */
    RESERVED_177                = 177,     /*!< reserved                                       */
    HASH2_IRQn                  = 178,     /*!< Hash2  interrupt                               */
    SDMMC3_IRQn                 = 179,     /*!< SDMMC3 Global interrupt                        */
    LPTIM2_IRQn                 = 180,     /*!< LPTIMER2 global interrupt                      */
    LPTIM3_IRQn                 = 181,     /*!< LPTIMER3 global interrupt                      */
    LPTIM4_IRQn                 = 182,     /*!< LPTIMER4 global interrupt                      */
    LPTIM5_IRQn                 = 183,     /*!< LPTIMER5 global interrupt                      */
    RESERVED_184                = 184,     /*!< reserved                                          */
    CPU1_SEV_IRQn               = 185,     /*!< Cortex-A35 Send Event through EXTI             */
    RCC_WAKEUP_IRQn             = 186,     /*!< RCC CPU2 Wake up interrupt                     */
    SAI4_IRQn                   = 187,     /*!< SAI4 global interrupt                          */
    DTS_IRQn                    = 188,     /*!< Temperature sensor interrupt                   */
    TIM11_IRQn                  = 189,     /*!< TIM11 global interrupt                         */
    CPU2_WAKEUP_PIN_IRQn        = 190,     /*!< Interrupt for all 6 wake-up enabled by CPU2    */
    OTG_IRQn                    = 191,     /*!< USB2 DR global interrupt                       */
    RNG2_IRQn                   = 192,     /*!< RNG2 interrupt                                 */
    RESERVED_193                = 193,     /*!< reserved                                       */
    RESERVED_194                = 194,     /*!< reserved                                       */
    SERF_IRQn                   = 195,     /*!< SERF global interrupt                          */
    RESERVED_196                = 196,     /*!< reserved                                       */
    RAMCFG_IRQn                 = 197,     /*!< RAM configuration global interrupt             */
    DDRCTRL_IRQn                = 198,     /*!< DDRCTRL interrupt                              */
    DDRPHYC_IRQn                = 199,     /*!< DDRPHY interrupt (active low)                  */
    DFI_ERR_IRQn                = 200,     /*!< DDRPHY DFI error Interrupt                     */
    IAC_IRQn                    = 201,     /*!< RIF Illegal access Controller interrupt        */
