zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_cm33.h
/*
* @brief RTC Specific device feature definitions
*/
#define RTC_BKP_NB         128U
#define RTC_TAMP_NB        7U
#define RTC_INT_TAMP_NB    16U

/**
  * @brief Real-Time Clock
  */
typedef struct
{
  __IO uint32_t TR;             /*!< RTC time register                                Address offset: 0x000 */
  __IO uint32_t DR;             /*!< RTC date register                                Address offset: 0x004 */
  __IO uint32_t SSR;            /*!< RTC sub second register                          Address offset: 0x008 */
  __IO uint32_t ICSR;           /*!< RTC initialization control and status register   Address offset: 0x00C */
  __IO uint32_t PRER;           /*!< RTC prescaler register                           Address offset: 0x010 */
  __IO uint32_t WUTR;           /*!< RTC wakeup timer register                        Address offset: 0x014 */
  __IO uint32_t CR;             /*!< RTC control register                             Address offset: 0x018 */
  __IO uint32_t PRIVCR;         /*!< RTC privilege mode control register              Address offset: 0x01C */
  __IO uint32_t SECCFGR;        /*!< RTC secure mode control register                 Address offset: 0x020 */
  __IO uint32_t WPR;            /*!< RTC write protection register                    Address offset: 0x024 */
  __IO uint32_t CALR;           /*!< RTC calibration register                         Address offset: 0x028 */
  __IO uint32_t SHIFTR;         /*!< RTC shift control register                       Address offset: 0x02C */
  __IO uint32_t TSTR;           /*!< RTC timestamp time register                      Address offset: 0x030 */
  __IO uint32_t TSDR;           /*!< RTC timestamp date register                      Address offset: 0x034 */
  __IO uint32_t TSSSR;          /*!< RTC timestamp sub second register                Address offset: 0x038 */
       uint32_t RESERVED0;      /*!< Reserved                                         Address offset: 0x03C */
  __IO uint32_t ALRMAR;         /*!< RTC alarm A register                             Address offset: 0x040 */
  __IO uint32_t ALRMASSR;       /*!< RTC alarm A sub second register                  Address offset: 0x044 */
  __IO uint32_t ALRMBR;         /*!< RTC alarm B register                             Address offset: 0x048 */
  __IO uint32_t ALRMBSSR;       /*!< RTC alarm B sub second register                  Address offset: 0x04C */
  __IO uint32_t SR;             /*!< RTC Status register                              Address offset: 0x050 */
  __IO uint32_t MISR;           /*!< RTC non-secure masked interrupt status register  Address offset: 0x054 */
  __IO uint32_t SMISR;          /*!< RTC secure masked interrupt status register      Address offset: 0x058 */
  __IO uint32_t SCR;            /*!< RTC status Clear register                        Address offset: 0x05C */
  __IO uint32_t CFGR;           /*!< RTC configuration register                       Address offset: 0x060 */
       uint32_t RESERVED1[3];   /*!< Reserved                                         Address offset: 0x064-0x06C */
  __IO uint32_t ALRABINR;       /*!< RTC alarm A binary mode register                 Address offset: 0x070 */
  __IO uint32_t ALRBBINR;       /*!< RTC alarm B binary mode register                 Address offset: 0x074 */
       uint32_t RESERVED2[2];   /*!< Reserved                                         Address offset: 0x078-0x07C */
  __IO uint32_t RCIDCFGR[6];    /*!< RTC Resource x CID configuration register        Address offset: 0x080-0x094 */
       uint32_t RESERVED3[214]; /*!< Reserved                                         Address offset: 0x098-0x3EC */
  __IO uint32_t HWCFGR;         /*!< RTC hardware configuration register              Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< RTC version register                             Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< RTC identification register                      Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< RTC size identification register                 Address offset: 0x3FC */
} RTC_TypeDef;


/**
  * @brief Serial Audio Interface
  */

typedef struct
{
  __IO uint32_t GCR;            /*!< SAI global configuration register, Address offset: 0x000 */
  uint32_t      RESERVED0[16];  /*!< Reserved,                          Address offset: 0x004-0x040 */
  __IO uint32_t PDMCR;          /*!< SAI PDM control register,          Address offset: 0x044 */
  __IO uint32_t PDMDLY;         /*!< SAI PDM delay register,            Address offset: 0x048 */
  uint32_t      RESERVED1[233]; /*!< Reserved,                          Address offset: 0x04C-0x3EC */
  __IO uint32_t HWCFGR;         /*!< SAI HW Configuration register,     Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< SAI Version register,              Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< SAI Identification register,       Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< SAI Size Identification register,  Address offset: 0x3FC */
} SAI_TypeDef;

typedef struct
{
  __IO uint32_t CR1;      /*!< SAI block x configuration register 1,     Address offset: 0x04 */
  __IO uint32_t CR2;      /*!< SAI block x configuration register 2,     Address offset: 0x08 */
  __IO uint32_t FRCR;     /*!< SAI block x frame configuration register, Address offset: 0x0C */
  __IO uint32_t SLOTR;    /*!< SAI block x slot register,                Address offset: 0x10 */
  __IO uint32_t IMR;      /*!< SAI block x interrupt mask register,      Address offset: 0x14 */
  __IO uint32_t SR;       /*!< SAI block x status register,              Address offset: 0x18 */
  __IO uint32_t CLRFR;    /*!< SAI block x clear flag register,          Address offset: 0x1C */
  __IO uint32_t DR;       /*!< SAI block x data register,                Address offset: 0x20 */
} SAI_Block_TypeDef;

/**
  * @brief Secure digital input/output Interface
  */

typedef struct
{
  __IO uint32_t POWER;          /*!< SDMMC power control register,               Address offset: 0x00 */
  __IO uint32_t CLKCR;          /*!< SDMMC clock control register,               Address offset: 0x04 */
  __IO uint32_t ARG;            /*!< SDMMC argument register,                    Address offset: 0x08 */
  __IO uint32_t CMD;            /*!< SDMMC command register,                     Address offset: 0x0C */
  __I  uint32_t RESPCMD;        /*!< SDMMC command response register,            Address offset: 0x10 */
  __I  uint32_t RESP1;          /*!< SDMMC response 1 register,                  Address offset: 0x14 */
  __I  uint32_t RESP2;          /*!< SDMMC response 2 register,                  Address offset: 0x18 */
  __I  uint32_t RESP3;          /*!< SDMMC response 3 register,                  Address offset: 0x1C */
  __I  uint32_t RESP4;          /*!< SDMMC response 4 register,                  Address offset: 0x20 */
  __IO uint32_t DTIMER;         /*!< SDMMC data timer register,                  Address offset: 0x24 */
  __IO uint32_t DLEN;           /*!< SDMMC data length register,                 Address offset: 0x28 */
  __IO uint32_t DCTRL;          /*!< SDMMC data control register,                Address offset: 0x2C */
  __I  uint32_t DCOUNT;         /*!< SDMMC data counter register,                Address offset: 0x30 */
  __I  uint32_t STA;            /*!< SDMMC status register,                      Address offset: 0x34 */
  __IO uint32_t ICR;            /*!< SDMMC interrupt clear register,             Address offset: 0x38 */
  __IO uint32_t MASK;           /*!< SDMMC mask register,                        Address offset: 0x3C */
  __IO uint32_t ACKTIME;        /*!< SDMMC Acknowledgement timer register,       Address offset: 0x40 */
  __IO uint32_t FIFOTHR;        /*!< SDMMC data FIFO threshold register          Address offset: 0x44 */
       uint32_t RESERVED0[2];   /*!< Reserved,                                   Address offset: 0x48 - 0x4C */
  __IO uint32_t IDMACTRL;       /*!< SDMMC DMA control register,                 Address offset: 0x50 */
  __IO uint32_t IDMABSIZE;      /*!< SDMMC DMA buffer size register,             Address offset: 0x54 */
  __IO uint32_t IDMABASER;      /*!< SDMMC DMA buffer 0 base address register,   Address offset: 0x58 */
       uint32_t RESERVED1[2];   /*!< Reserved,                                   Address offset: 0x5C - 0x60 */
  __IO uint32_t IDMALAR;        /*!< SDMMC DMA linked list address register,     Address offset: 0x64 */
  __IO uint32_t IDMABAR;        /*!< SDMMC DMA linked list memory base register, Address offset: 0x68 */
       uint32_t RESERVED2[5];   /*!< Reserved,                                   Address offset: 0x6C - 0x7C */
  __IO uint32_t FIFO;           /*!< SDMMC data FIFO register,                   Address offset: 0x80 - 0xBC */
       uint32_t RESERVED3[204]; /*!< Reserved,                                   Address offset: 0xBC - 0x3F0 */
  __IO uint32_t HWCFGR1;        /*!< SDMMC hardware configuration register 1     Address offset: 0x3F0 */
  __IO uint32_t VERR;           /*!< SDMMC version register,                     Address offset: 0x3F4 */
  __IO uint32_t IPIDR;          /*!< SDMMC identification register,              Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< SDMMC size ID register,                     Address offset: 0x3FC */
} SDMMC_TypeDef;

/**
  * @brief Software Error Robustness Collector (SERC)
  *        reference document : "SERF (Software Error Robustness Framework)
  *                              user Specification"
  *                             SERF_user_specification1.0.5.pdf
  *                             (Revision 1.0.5 - March 16th, 2020)
  */
typedef struct
{
  __IO uint32_t IER[6];         /*!< SERC Interrupt Enable registers,         Address offset: 0x000-0x014 */
       uint32_t RESERVED1[10];  /*!< Reserved,                                                0x018-0x03C */
  __IO uint32_t ISR[6];         /*!< SERC Interrupt Status registers,         Address offset: 0x040-0x054 */
       uint32_t RESERVED2[10];  /*!< Reserved,                                                0x058-0x07C */
  __IO uint32_t ICR[6];         /*!< SERC Interrupt Clear registers,          Address offset: 0x080-0x094 */
       uint32_t RESERVED3[26];  /*!< Reserved,                                                0x098-0x0FC */
  __IO uint32_t ENABLE;         /*!< SERF Enable register,                    Address offset:       0x100 */
       uint32_t RESERVED4[187]; /*!< Reserved,                                                0x104-0x3EC */
  __IO uint32_t HWCFGR;         /*!< SERF HardWare Configuration register,    Address offset:       0x3F0 */
  __IO uint32_t VERR;           /*!< SERF Version register,                   Address offset:       0x3F4 */
  __IO uint32_t IPIDR;          /*!< SERF IP Identification register,         Address offset:       0x3F8 */
  __IO uint32_t SIDR;           /*!< SERF Size Identification register,       Address offset:       0x3FC */
} SERC_TypeDef;

/**
  * @brief SPDIF-RX Interface
  */

typedef struct
{
  __IO uint32_t CR;             /*!< SPDIFRX control register,                   Address offset: 0x00 */
  __IO uint32_t IMR;            /*!< SPDIFRX interrupt mask register,            Address offset: 0x04 */
  __IO uint32_t SR;             /*!< SPDIFRX status register,                    Address offset: 0x08 */
  __IO uint32_t IFCR;           /*!< SPDIFRX interrupt Flag Clear register,      Address offset: 0x0C */
  __IO uint32_t DR;             /*!< SPDIFRX data input register,                Address offset: 0x10 */
  __IO uint32_t CSR;            /*!< SPDIFRX channel Status register,            Address offset: 0x14 */
  __IO uint32_t DIR;            /*!< SPDIFRX debug Information register,         Address offset: 0x18 */
  uint32_t      RESERVED2[246]; /*!< Reserved,                                   Address offst:  0x1C-0x3F0 */
  __IO uint32_t VERR;           /*!< SPDIFRX version register,                   Address offset: 0x34F */
  __IO uint32_t IPIDR;          /*!< SPDIFRX identification register,            Address offset: 0x3F8 */
  __IO uint32_t SIDR;           /*!< SPDIFRX size ID register,                   Address offset: 0x3FC */
} SPDIFRX_TypeDef;

/**
  * @brief SPI/I2S
  *
  *     Serial peripheral interface and integrated interchip sound
  *     User Spec c7amba_spi2s3 version v2.0  (April 21th, 2020 Draft!!)
  *
  */
typedef struct
{
  __IO uint32_t CR1;              /*!< SPI/I2S Control register 1,                         Address offset: 0x000       */
  __IO uint32_t CR2;              /*!< SPI Control register 2,                             Address offset: 0x004       */
  __IO uint32_t CFG1;             /*!< SPI Configuration register 1,                       Address offset: 0x008       */
  __IO uint32_t CFG2;             /*!< SPI Configuration register 2,                       Address offset: 0x00C       */
  __IO uint32_t IER;              /*!< SPI/I2S Interrupt Enable register,                  Address offset: 0x010       */
  __IO uint32_t SR;               /*!< SPI Status register,                                Address offset: 0x014       */
  __IO uint32_t IFCR;             /*!< SPI/I2S Interrupt/Status Flags Clear register,      Address offset: 0x018       */
  __IO uint32_t AUTOCR;           /*!< SPI/I2S Autonomous Mode Control register,           Address offset: 0x01C       */
  __IO uint32_t TXDR;             /*!< SPI/I2S Transmit data register,                     Address offset: 0x020       */
  uint32_t      RESERVED0[3];     /*!< Reserved,                                           Address offset: 0x024-0x02C */
  __IO uint32_t RXDR;             /*!< SPI/I2S Receive data register,                      Address offset: 0x030       */
  uint32_t      RESERVED1[3];     /*!< Reserved,                                           Adresse offset: 0X034-0x03C */
  __IO uint32_t CRCPOLY;          /*!< SPI CRC Polynomial register,                        Address offset: 0x040       */
  __IO uint32_t TXCRC;            /*!< SPI Transmitter CRC register,                       Address offset: 0x044       */
  __IO uint32_t RXCRC;            /*!< SPI Receiver CRC register,                          Address offset: 0x048       */
  __IO uint32_t UDRDR;            /*!< SPI Underrun data register,                         Address offset: 0x04C       */
  __IO uint32_t I2SCFGR;          /*!< SPI/I2S configuration register,                     Address offset: 0x050       */
  uint32_t      RESERVED2[230];   /*!< Reserved,                                           Adresse offset: 0X054-0x3E8 */
  __IO uint32_t HWCFGR2;          /*!< SPI/I2S hardware configuration register 2,          Address offset: 0x03EC      */
  __IO uint32_t HWCFGR1;          /*!< SPI/I2S hardware configuration register 1,          Address offset: 0x03F0      */
  __IO uint32_t VERR;             /*!< SPI/I2S Version register,                           Address offset: 0x03F4      */
  __IO uint32_t IPIDR;            /*!< SPI/I2S Identification register,                    Address offset: 0x03F8      */
  __IO uint32_t SIDR;             /*!< SPI/I2S Size Identification register,               Address offset: 0x03FC      */
} SPI_TypeDef;

/**
  * @brief STGENC System Timestamp Generator Control
  *        ref. ARM CoreSight SoC-400 Rev.r3p1 TRM [ARM DDI 0480F]
  *             see #3.18 "Timestamp generator register summary"
  */
typedef struct
{
  __IO uint32_t CNTCR;   /*!< STGENC Counter Control Register,              Address offset: 0x000 */
       uint32_t CNTSR;   /*!< STGENC Counter Status Register,               Address offset: 0x004 */
  __IO uint32_t CNTCVL;  /*!< STGENC Current Counter Value Lower Register,  Address offset: 0x008 */
  __IO uint32_t CNTCVU;  /*!< STGENC Current Counter Value Upper Register,  Address offset: 0x00C */
       uint32_t RESERVED1[4];                         /*!< Reserved, Address offsets: 0x010-0x01C */
  __IO uint32_t CNTFID0; /*!< STGENC Base Frequency ID Register,            Address offset: 0x020 */
       uint32_t RESERVED2[1003];                      /*!< Reserved, Address offsets: 0x024-0xFCC */
  __IO uint32_t PIDR4;   /*!< STGENC Peripheral ID4 Register,               Address offset: 0xFD0 */
  __IO uint32_t RESERVED3[3];                         /*!< Reserved, Address offsets: 0xFD4-0xFDC */
  __IO uint32_t PIDR[4]; /*!< STGENC Peripheral ID0-ID3 Registers,          Address offset: 0xFE0 */
  __IO uint32_t CIDR[4]; /*!< STGENC Component ID0-ID3 Registers,           Address offset: 0xFF0 */
} STGENC_TypeDef;

/**
  * @brief STGENR System Timestamp Generator Read
  */
typedef struct
{
  __IO uint32_t CNTCVL;  /*!< STGENR Current Counter Value Lower Register,  Address offset: 0x000 */
  __IO uint32_t CNTCVU;  /*!< STGENR Current Counter Value Upper Register,  Address offset: 0x004 */
       uint32_t RESERVED1[1010];                      /*!< Reserved, Address offsets: 0x008-0xFCC */
  __IO uint32_t PIDR4;   /*!< STGENR Peripheral ID4 Register,               Address offset: 0xFD0 */
  __IO uint32_t RESERVED2[3];                         /*!< Reserved, Address offsets: 0xFD4-0xFDC */
  __IO uint32_t PIDR[4]; /*!< STGENR Peripheral ID0-ID3 Registers,          Address offset: 0xFE0 */
  __IO uint32_t CIDR[4]; /*!< STGENR Component ID0-ID3 Registers,           Address offset: 0xFF0 */
} STGENR_TypeDef;

