zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_cm33.h
/******************  Bit definition for EXTI1_FPR1 register  *******************/
#define EXTI1_FPR1_FPIF0_Pos         (0U)
#define EXTI1_FPR1_FPIF0_Msk         (0x1UL << EXTI1_FPR1_FPIF0_Pos)                /*!< 0x00000001 */
#define EXTI1_FPR1_FPIF0             EXTI1_FPR1_FPIF0_Msk                          /*!< Falling trigger event configuration bit of line 0 */
#define EXTI1_FPR1_FPIF1_Pos         (1U)
#define EXTI1_FPR1_FPIF1_Msk         (0x1UL << EXTI1_FPR1_FPIF1_Pos)                /*!< 0x00000002 */
#define EXTI1_FPR1_FPIF1             EXTI1_FPR1_FPIF1_Msk                          /*!< Falling trigger event configuration bit of line 1 */
#define EXTI1_FPR1_FPIF2_Pos         (2U)
#define EXTI1_FPR1_FPIF2_Msk         (0x1UL << EXTI1_FPR1_FPIF2_Pos)                /*!< 0x00000004 */
#define EXTI1_FPR1_FPIF2             EXTI1_FPR1_FPIF2_Msk                          /*!< Falling trigger event configuration bit of line 2 */
#define EXTI1_FPR1_FPIF3_Pos         (3U)
#define EXTI1_FPR1_FPIF3_Msk         (0x1UL << EXTI1_FPR1_FPIF3_Pos)                /*!< 0x00000008 */
#define EXTI1_FPR1_FPIF3             EXTI1_FPR1_FPIF3_Msk                          /*!< Falling trigger event configuration bit of line 3 */
#define EXTI1_FPR1_FPIF4_Pos         (4U)
#define EXTI1_FPR1_FPIF4_Msk         (0x1UL << EXTI1_FPR1_FPIF4_Pos)                /*!< 0x00000010 */
#define EXTI1_FPR1_FPIF4             EXTI1_FPR1_FPIF4_Msk                          /*!< Falling trigger event configuration bit of line 4 */
#define EXTI1_FPR1_FPIF5_Pos         (5U)
#define EXTI1_FPR1_FPIF5_Msk         (0x1UL << EXTI1_FPR1_FPIF5_Pos)                /*!< 0x00000020 */
#define EXTI1_FPR1_FPIF5             EXTI1_FPR1_FPIF5_Msk                          /*!< Falling trigger event configuration bit of line 5 */
#define EXTI1_FPR1_FPIF6_Pos         (6U)
#define EXTI1_FPR1_FPIF6_Msk         (0x1UL << EXTI1_FPR1_FPIF6_Pos)                /*!< 0x00000040 */
#define EXTI1_FPR1_FPIF6             EXTI1_FPR1_FPIF6_Msk                          /*!< Falling trigger event configuration bit of line 6 */
#define EXTI1_FPR1_FPIF7_Pos         (7U)
#define EXTI1_FPR1_FPIF7_Msk         (0x1UL << EXTI1_FPR1_FPIF7_Pos)                /*!< 0x00000080 */
#define EXTI1_FPR1_FPIF7             EXTI1_FPR1_FPIF7_Msk                          /*!< Falling trigger event configuration bit of line 7 */
#define EXTI1_FPR1_FPIF8_Pos         (8U)
#define EXTI1_FPR1_FPIF8_Msk         (0x1UL << EXTI1_FPR1_FPIF8_Pos)                /*!< 0x00000100 */
#define EXTI1_FPR1_FPIF8             EXTI1_FPR1_FPIF8_Msk                          /*!< Falling trigger event configuration bit of line 8 */
#define EXTI1_FPR1_FPIF9_Pos         (9U)
#define EXTI1_FPR1_FPIF9_Msk         (0x1UL << EXTI1_FPR1_FPIF9_Pos)                /*!< 0x00000200 */
#define EXTI1_FPR1_FPIF9             EXTI1_FPR1_FPIF9_Msk                          /*!< Falling trigger event configuration bit of line 9 */
#define EXTI1_FPR1_FPIF10_Pos        (10U)
#define EXTI1_FPR1_FPIF10_Msk        (0x1UL << EXTI1_FPR1_FPIF10_Pos)               /*!< 0x00000400 */
#define EXTI1_FPR1_FPIF10            EXTI1_FPR1_FPIF10_Msk                         /*!< Falling trigger event configuration bit of line 10 */
#define EXTI1_FPR1_FPIF11_Pos        (11U)
#define EXTI1_FPR1_FPIF11_Msk        (0x1UL << EXTI1_FPR1_FPIF11_Pos)               /*!< 0x00000800 */
#define EXTI1_FPR1_FPIF11            EXTI1_FPR1_FPIF11_Msk                         /*!< Falling trigger event configuration bit of line 11 */
#define EXTI1_FPR1_FPIF12_Pos        (12U)
#define EXTI1_FPR1_FPIF12_Msk        (0x1UL << EXTI1_FPR1_FPIF12_Pos)               /*!< 0x00001000 */
#define EXTI1_FPR1_FPIF12            EXTI1_FPR1_FPIF12_Msk                         /*!< Falling trigger event configuration bit of line 12 */
#define EXTI1_FPR1_FPIF13_Pos        (13U)
#define EXTI1_FPR1_FPIF13_Msk        (0x1UL << EXTI1_FPR1_FPIF13_Pos)               /*!< 0x00002000 */
#define EXTI1_FPR1_FPIF13            EXTI1_FPR1_FPIF13_Msk                         /*!< Falling trigger event configuration bit of line 13 */
#define EXTI1_FPR1_FPIF14_Pos        (14U)
#define EXTI1_FPR1_FPIF14_Msk        (0x1UL << EXTI1_FPR1_FPIF14_Pos)               /*!< 0x00004000 */
#define EXTI1_FPR1_FPIF14            EXTI1_FPR1_FPIF14_Msk                         /*!< Falling trigger event configuration bit of line 14 */
#define EXTI1_FPR1_FPIF15_Pos        (15U)
#define EXTI1_FPR1_FPIF15_Msk        (0x1UL << EXTI1_FPR1_FPIF15_Pos)               /*!< 0x00008000 */
#define EXTI1_FPR1_FPIF15            EXTI1_FPR1_FPIF15_Msk                         /*!< Falling trigger event configuration bit of line 15 */
#define EXTI1_FPR1_FPIF16_Pos        (16U)
#define EXTI1_FPR1_FPIF16_Msk        (0x1UL << EXTI1_FPR1_FPIF16_Pos)               /*!< 0x00010000 */
#define EXTI1_FPR1_FPIF16            EXTI1_FPR1_FPIF16_Msk                         /*!< Falling trigger event configuration bit of line 16 */
#define EXTI1_FPR1_FPIF17_Pos        (17U)
#define EXTI1_FPR1_FPIF17_Msk        (0x1UL << EXTI1_FPR1_FPIF17_Pos)               /*!< 0x00020000 */
#define EXTI1_FPR1_FPIF17            EXTI1_FPR1_FPIF17_Msk                         /*!< Falling trigger event configuration bit of line 17 */
#define EXTI1_FPR1_FPIF18_Pos        (18U)
#define EXTI1_FPR1_FPIF18_Msk        (0x1UL << EXTI1_FPR1_FPIF18_Pos)               /*!< 0x00040000 */
#define EXTI1_FPR1_FPIF18            EXTI1_FPR1_FPIF18_Msk                         /*!< Falling trigger event configuration bit of line 18 */


/******************  Bit definition for EXTI1_SECCFGR1  register  ******************/
#define EXTI1_SECCFGR1_SEC0_Pos  (0U)
#define EXTI1_SECCFGR1_SEC0_Msk  (0x1UL << EXTI1_SECCFGR1_SEC0_Pos)          /*!< 0x00000001 */
#define EXTI1_SECCFGR1_SEC0      EXTI1_SECCFGR1_SEC0_Msk                    /*!< SEC/PRIV enable on event input 0 */
#define EXTI1_SECCFGR1_SEC1_Pos  (1U)
#define EXTI1_SECCFGR1_SEC1_Msk  (0x1UL << EXTI1_SECCFGR1_SEC1_Pos)          /*!< 0x00000002 */
#define EXTI1_SECCFGR1_SEC1      EXTI1_SECCFGR1_SEC1_Msk                    /*!< SEC/PRIV enable on event input 1 */
#define EXTI1_SECCFGR1_SEC2_Pos  (2U)
#define EXTI1_SECCFGR1_SEC2_Msk  (0x1UL << EXTI1_SECCFGR1_SEC2_Pos)          /*!< 0x00000004 */
#define EXTI1_SECCFGR1_SEC2      EXTI1_SECCFGR1_SEC2_Msk                    /*!< SEC/PRIV enable on event input 2 */
#define EXTI1_SECCFGR1_SEC3_Pos  (3U)
#define EXTI1_SECCFGR1_SEC3_Msk  (0x1UL << EXTI1_SECCFGR1_SEC3_Pos)          /*!< 0x00000008 */
#define EXTI1_SECCFGR1_SEC3      EXTI1_SECCFGR1_SEC3_Msk                    /*!< SEC/PRIV enable on event input 3 */
#define EXTI1_SECCFGR1_SEC4_Pos  (4U)
#define EXTI1_SECCFGR1_SEC4_Msk  (0x1UL << EXTI1_SECCFGR1_SEC4_Pos)          /*!< 0x00000010 */
#define EXTI1_SECCFGR1_SEC4      EXTI1_SECCFGR1_SEC4_Msk                    /*!< SEC/PRIV enable on event input 4 */
#define EXTI1_SECCFGR1_SEC5_Pos  (5U)
#define EXTI1_SECCFGR1_SEC5_Msk  (0x1UL << EXTI1_SECCFGR1_SEC5_Pos)          /*!< 0x00000020 */
#define EXTI1_SECCFGR1_SEC5      EXTI1_SECCFGR1_SEC5_Msk                    /*!< SEC/PRIV enable on event input 5 */
#define EXTI1_SECCFGR1_SEC6_Pos  (6U)
#define EXTI1_SECCFGR1_SEC6_Msk  (0x1UL << EXTI1_SECCFGR1_SEC6_Pos)          /*!< 0x00000040 */
#define EXTI1_SECCFGR1_SEC6      EXTI1_SECCFGR1_SEC6_Msk                    /*!< SEC/PRIV enable on event input 6 */
#define EXTI1_SECCFGR1_SEC7_Pos  (7U)
#define EXTI1_SECCFGR1_SEC7_Msk  (0x1UL << EXTI1_SECCFGR1_SEC7_Pos)          /*!< 0x00000080 */
#define EXTI1_SECCFGR1_SEC7      EXTI1_SECCFGR1_SEC7_Msk                    /*!< SEC/PRIV enable on event input 7 */
#define EXTI1_SECCFGR1_SEC8_Pos  (8U)
#define EXTI1_SECCFGR1_SEC8_Msk  (0x1UL << EXTI1_SECCFGR1_SEC8_Pos)          /*!< 0x00000100 */
#define EXTI1_SECCFGR1_SEC8      EXTI1_SECCFGR1_SEC8_Msk                    /*!< SEC/PRIV enable on event input 8 */
#define EXTI1_SECCFGR1_SEC9_Pos  (9U)
#define EXTI1_SECCFGR1_SEC9_Msk  (0x1UL << EXTI1_SECCFGR1_SEC9_Pos)          /*!< 0x00000200 */
#define EXTI1_SECCFGR1_SEC9      EXTI1_SECCFGR1_SEC9_Msk                    /*!< SEC/PRIV enable on event input 9 */
#define EXTI1_SECCFGR1_SEC10_Pos (10U)
#define EXTI1_SECCFGR1_SEC10_Msk (0x1UL << EXTI1_SECCFGR1_SEC10_Pos)         /*!< 0x00000400 */
#define EXTI1_SECCFGR1_SEC10     EXTI1_SECCFGR1_SEC10_Msk                   /*!< SEC/PRIV enable on event input 10 */
#define EXTI1_SECCFGR1_SEC11_Pos (11U)
#define EXTI1_SECCFGR1_SEC11_Msk (0x1UL << EXTI1_SECCFGR1_SEC11_Pos)         /*!< 0x00000800 */
#define EXTI1_SECCFGR1_SEC11     EXTI1_SECCFGR1_SEC11_Msk                   /*!< SEC/PRIV enable on event input 11 */
#define EXTI1_SECCFGR1_SEC12_Pos (12U)
#define EXTI1_SECCFGR1_SEC12_Msk (0x1UL << EXTI1_SECCFGR1_SEC12_Pos)         /*!< 0x00001000 */
#define EXTI1_SECCFGR1_SEC12     EXTI1_SECCFGR1_SEC12_Msk                   /*!< SEC/PRIV enable on event input 12 */
#define EXTI1_SECCFGR1_SEC13_Pos (13U)
#define EXTI1_SECCFGR1_SEC13_Msk (0x1UL << EXTI1_SECCFGR1_SEC13_Pos)         /*!< 0x00002000 */
#define EXTI1_SECCFGR1_SEC13     EXTI1_SECCFGR1_SEC13_Msk                   /*!< SEC/PRIV enable on event input 13 */
#define EXTI1_SECCFGR1_SEC14_Pos (14U)
#define EXTI1_SECCFGR1_SEC14_Msk (0x1UL << EXTI1_SECCFGR1_SEC14_Pos)         /*!< 0x00004000 */
#define EXTI1_SECCFGR1_SEC14     EXTI1_SECCFGR1_SEC14_Msk                   /*!< SEC/PRIV enable on event input 14 */
#define EXTI1_SECCFGR1_SEC15_Pos (15U)
#define EXTI1_SECCFGR1_SEC15_Msk (0x1UL << EXTI1_SECCFGR1_SEC15_Pos)         /*!< 0x00008000 */
#define EXTI1_SECCFGR1_SEC15     EXTI1_SECCFGR1_SEC15_Msk                   /*!< SEC/PRIV enable on event input 15 */
#define EXTI1_SECCFGR1_SEC16_Pos (16U)
#define EXTI1_SECCFGR1_SEC16_Msk (0x1UL << EXTI1_SECCFGR1_SEC16_Pos)         /*!< 0x00010000 */
#define EXTI1_SECCFGR1_SEC16     EXTI1_SECCFGR1_SEC16_Msk                   /*!< SEC/PRIV enable on event input 16 */
#define EXTI1_SECCFGR1_SEC17_Pos (17U)
#define EXTI1_SECCFGR1_SEC17_Msk (0x1UL << EXTI1_SECCFGR1_SEC17_Pos)         /*!< 0x00020000 */
#define EXTI1_SECCFGR1_SEC17     EXTI1_SECCFGR1_SEC17_Msk                   /*!< SEC/PRIV enable on event input 17 */
#define EXTI1_SECCFGR1_SEC18_Pos (18U)
#define EXTI1_SECCFGR1_SEC18_Msk (0x1UL << EXTI1_SECCFGR1_SEC18_Pos)         /*!< 0x00040000 */
#define EXTI1_SECCFGR1_SEC18     EXTI1_SECCFGR1_SEC18_Msk                   /*!< SEC/PRIV enable on event input 18 */
#define EXTI1_SECCFGR1_SEC19_Pos (19U)
#define EXTI1_SECCFGR1_SEC19_Msk (0x1UL << EXTI1_SECCFGR1_SEC19_Pos)         /*!< 0x00080000 */
#define EXTI1_SECCFGR1_SEC19     EXTI1_SECCFGR1_SEC19_Msk                   /*!< SEC/PRIV enable on event input 19 */
/* no event input 20  */
#define EXTI1_SECCFGR1_SEC21_Pos (21U)
#define EXTI1_SECCFGR1_SEC21_Msk (0x1UL << EXTI1_SECCFGR1_SEC21_Pos)         /*!< 0x00200000 */
#define EXTI1_SECCFGR1_SEC21     EXTI1_SECCFGR1_SEC21_Msk                   /*!< SEC/PRIV enable on event input 21 */
#define EXTI1_SECCFGR1_SEC22_Pos (22U)
#define EXTI1_SECCFGR1_SEC22_Msk (0x1UL << EXTI1_SECCFGR1_SEC22_Pos)         /*!< 0x00400000 */
#define EXTI1_SECCFGR1_SEC22     EXTI1_SECCFGR1_SEC22_Msk                   /*!< SEC/PRIV enable on event input 22 */
#define EXTI1_SECCFGR1_SEC23_Pos (23U)
#define EXTI1_SECCFGR1_SEC23_Msk (0x1UL << EXTI1_SECCFGR1_SEC23_Pos)         /*!< 0x00800000 */
#define EXTI1_SECCFGR1_SEC23     EXTI1_SECCFGR1_SEC23_Msk                   /*!< SEC/PRIV enable on event input 23 */
#define EXTI1_SECCFGR1_SEC24_Pos (24U)
#define EXTI1_SECCFGR1_SEC24_Msk (0x1UL << EXTI1_SECCFGR1_SEC24_Pos)         /*!< 0x01000000 */
#define EXTI1_SECCFGR1_SEC24     EXTI1_SECCFGR1_SEC24_Msk                   /*!< SEC/PRIV enable on event input 24 */
#define EXTI1_SECCFGR1_SEC25_Pos (25U)
#define EXTI1_SECCFGR1_SEC25_Msk (0x1UL << EXTI1_SECCFGR1_SEC25_Pos)         /*!< 0x02000000 */
#define EXTI1_SECCFGR1_SEC25     EXTI1_SECCFGR1_SEC25_Msk                   /*!< SEC/PRIV enable on event input 25 */
#define EXTI1_SECCFGR1_SEC26_Pos (26U)
#define EXTI1_SECCFGR1_SEC26_Msk (0x1UL << EXTI1_SECCFGR1_SEC26_Pos)         /*!< 0x04000000 */
#define EXTI1_SECCFGR1_SEC26     EXTI1_SECCFGR1_SEC26_Msk                   /*!< SEC/PRIV enable on event input 26 */
#define EXTI1_SECCFGR1_SEC27_Pos (27U)
#define EXTI1_SECCFGR1_SEC27_Msk (0x1UL << EXTI1_SECCFGR1_SEC27_Pos)         /*!< 0x08000000 */
#define EXTI1_SECCFGR1_SEC27     EXTI1_SECCFGR1_SEC27_Msk                   /*!< SEC/PRIV enable on event input 27 */
#define EXTI1_SECCFGR1_SEC28_Pos (28U)
#define EXTI1_SECCFGR1_SEC28_Msk (0x1UL << EXTI1_SECCFGR1_SEC28_Pos)         /*!< 0x10000000 */
#define EXTI1_SECCFGR1_SEC28     EXTI1_SECCFGR1_SEC28_Msk                   /*!< SEC/PRIV enable on event input 28 */
#define EXTI1_SECCFGR1_SEC29_Pos (29U)
#define EXTI1_SECCFGR1_SEC29_Msk (0x1UL << EXTI1_SECCFGR1_SEC29_Pos)         /*!< 0x20000000 */
#define EXTI1_SECCFGR1_SEC29     EXTI1_SECCFGR1_SEC29_Msk                   /*!< SEC/PRIV enable on event input 29 */
#define EXTI1_SECCFGR1_SEC30_Pos (30U)
#define EXTI1_SECCFGR1_SEC30_Msk (0x1UL << EXTI1_SECCFGR1_SEC30_Pos)         /*!< 0x40000000 */
#define EXTI1_SECCFGR1_SEC30     EXTI1_SECCFGR1_SEC30_Msk                   /*!< SEC/PRIV enable on event input 30 */
#define EXTI1_SECCFGR1_SEC31_Pos (31U)
#define EXTI1_SECCFGR1_SEC31_Msk (0x1UL << EXTI1_SECCFGR1_SEC31_Pos)         /*!< 0x80000000 */
#define EXTI1_SECCFGR1_SEC31     EXTI1_SECCFGR1_SEC31_Msk                   /*!< SEC/PRIV enable on event input 31 */

/******************  Bit definition for EXTI1_PRIVCFGR1 register  ******************/
#define EXTI1_PRIVCFGR1_PRIV0_Pos  (0U)
#define EXTI1_PRIVCFGR1_PRIV0_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV0_Pos)          /*!< 0x00000001 */
#define EXTI1_PRIVCFGR1_PRIV0      EXTI1_PRIVCFGR1_PRIV0_Msk                    /*!< SEC/PRIV enable on event input 0 */
#define EXTI1_PRIVCFGR1_PRIV1_Pos  (1U)
#define EXTI1_PRIVCFGR1_PRIV1_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV1_Pos)          /*!< 0x00000002 */
#define EXTI1_PRIVCFGR1_PRIV1      EXTI1_PRIVCFGR1_PRIV1_Msk                    /*!< SEC/PRIV enable on event input 1 */
#define EXTI1_PRIVCFGR1_PRIV2_Pos  (2U)
#define EXTI1_PRIVCFGR1_PRIV2_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV2_Pos)          /*!< 0x00000004 */
#define EXTI1_PRIVCFGR1_PRIV2      EXTI1_PRIVCFGR1_PRIV2_Msk                    /*!< SEC/PRIV enable on event input 2 */
#define EXTI1_PRIVCFGR1_PRIV3_Pos  (3U)
#define EXTI1_PRIVCFGR1_PRIV3_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV3_Pos)          /*!< 0x00000008 */
#define EXTI1_PRIVCFGR1_PRIV3      EXTI1_PRIVCFGR1_PRIV3_Msk                    /*!< SEC/PRIV enable on event input 3 */
#define EXTI1_PRIVCFGR1_PRIV4_Pos  (4U)
#define EXTI1_PRIVCFGR1_PRIV4_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV4_Pos)          /*!< 0x00000010 */
#define EXTI1_PRIVCFGR1_PRIV4      EXTI1_PRIVCFGR1_PRIV4_Msk                    /*!< SEC/PRIV enable on event input 4 */
#define EXTI1_PRIVCFGR1_PRIV5_Pos  (5U)
#define EXTI1_PRIVCFGR1_PRIV5_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV5_Pos)          /*!< 0x00000020 */
#define EXTI1_PRIVCFGR1_PRIV5      EXTI1_PRIVCFGR1_PRIV5_Msk                    /*!< SEC/PRIV enable on event input 5 */
#define EXTI1_PRIVCFGR1_PRIV6_Pos  (6U)
#define EXTI1_PRIVCFGR1_PRIV6_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV6_Pos)          /*!< 0x00000040 */
#define EXTI1_PRIVCFGR1_PRIV6      EXTI1_PRIVCFGR1_PRIV6_Msk                    /*!< SEC/PRIV enable on event input 6 */
#define EXTI1_PRIVCFGR1_PRIV7_Pos  (7U)
#define EXTI1_PRIVCFGR1_PRIV7_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV7_Pos)          /*!< 0x00000080 */
#define EXTI1_PRIVCFGR1_PRIV7      EXTI1_PRIVCFGR1_PRIV7_Msk                    /*!< SEC/PRIV enable on event input 7 */
#define EXTI1_PRIVCFGR1_PRIV8_Pos  (8U)
#define EXTI1_PRIVCFGR1_PRIV8_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV8_Pos)          /*!< 0x00000100 */
#define EXTI1_PRIVCFGR1_PRIV8      EXTI1_PRIVCFGR1_PRIV8_Msk                    /*!< SEC/PRIV enable on event input 8 */
#define EXTI1_PRIVCFGR1_PRIV9_Pos  (9U)
#define EXTI1_PRIVCFGR1_PRIV9_Msk  (0x1UL << EXTI1_PRIVCFGR1_PRIV9_Pos)          /*!< 0x00000200 */
#define EXTI1_PRIVCFGR1_PRIV9      EXTI1_PRIVCFGR1_PRIV9_Msk                    /*!< SEC/PRIV enable on event input 9 */
#define EXTI1_PRIVCFGR1_PRIV10_Pos (10U)
#define EXTI1_PRIVCFGR1_PRIV10_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV10_Pos)         /*!< 0x00000400 */
#define EXTI1_PRIVCFGR1_PRIV10     EXTI1_PRIVCFGR1_PRIV10_Msk                   /*!< SEC/PRIV enable on event input 10 */
#define EXTI1_PRIVCFGR1_PRIV11_Pos (11U)
#define EXTI1_PRIVCFGR1_PRIV11_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV11_Pos)         /*!< 0x00000800 */
#define EXTI1_PRIVCFGR1_PRIV11     EXTI1_PRIVCFGR1_PRIV11_Msk                   /*!< SEC/PRIV enable on event input 11 */
#define EXTI1_PRIVCFGR1_PRIV12_Pos (12U)
#define EXTI1_PRIVCFGR1_PRIV12_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV12_Pos)         /*!< 0x00001000 */
#define EXTI1_PRIVCFGR1_PRIV12     EXTI1_PRIVCFGR1_PRIV12_Msk                   /*!< SEC/PRIV enable on event input 12 */
#define EXTI1_PRIVCFGR1_PRIV13_Pos (13U)
#define EXTI1_PRIVCFGR1_PRIV13_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV13_Pos)         /*!< 0x00002000 */
#define EXTI1_PRIVCFGR1_PRIV13     EXTI1_PRIVCFGR1_PRIV13_Msk                   /*!< SEC/PRIV enable on event input 13 */
#define EXTI1_PRIVCFGR1_PRIV14_Pos (14U)
#define EXTI1_PRIVCFGR1_PRIV14_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV14_Pos)         /*!< 0x00004000 */
#define EXTI1_PRIVCFGR1_PRIV14     EXTI1_PRIVCFGR1_PRIV14_Msk                   /*!< SEC/PRIV enable on event input 14 */
#define EXTI1_PRIVCFGR1_PRIV15_Pos (15U)
#define EXTI1_PRIVCFGR1_PRIV15_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV15_Pos)         /*!< 0x00008000 */
#define EXTI1_PRIVCFGR1_PRIV15     EXTI1_PRIVCFGR1_PRIV15_Msk                   /*!< SEC/PRIV enable on event input 15 */
#define EXTI1_PRIVCFGR1_PRIV16_Pos (16U)
#define EXTI1_PRIVCFGR1_PRIV16_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV16_Pos)         /*!< 0x00010000 */
#define EXTI1_PRIVCFGR1_PRIV16     EXTI1_PRIVCFGR1_PRIV16_Msk                   /*!< SEC/PRIV enable on event input 16 */
#define EXTI1_PRIVCFGR1_PRIV17_Pos (17U)
#define EXTI1_PRIVCFGR1_PRIV17_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV17_Pos)         /*!< 0x00020000 */
#define EXTI1_PRIVCFGR1_PRIV17     EXTI1_PRIVCFGR1_PRIV17_Msk                   /*!< SEC/PRIV enable on event input 17 */
#define EXTI1_PRIVCFGR1_PRIV18_Pos (18U)
#define EXTI1_PRIVCFGR1_PRIV18_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV18_Pos)         /*!< 0x00040000 */
#define EXTI1_PRIVCFGR1_PRIV18     EXTI1_PRIVCFGR1_PRIV18_Msk                   /*!< SEC/PRIV enable on event input 18 */
#define EXTI1_PRIVCFGR1_PRIV19_Pos (19U)
#define EXTI1_PRIVCFGR1_PRIV19_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV19_Pos)         /*!< 0x00080000 */
#define EXTI1_PRIVCFGR1_PRIV19     EXTI1_PRIVCFGR1_PRIV19_Msk                   /*!< SEC/PRIV enable on event input 19 */
/* no event input 20  */
#define EXTI1_PRIVCFGR1_PRIV21_Pos (21U)
#define EXTI1_PRIVCFGR1_PRIV21_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV21_Pos)         /*!< 0x00200000 */
#define EXTI1_PRIVCFGR1_PRIV21     EXTI1_PRIVCFGR1_PRIV21_Msk                   /*!< SEC/PRIV enable on event input 21 */
#define EXTI1_PRIVCFGR1_PRIV22_Pos (22U)
#define EXTI1_PRIVCFGR1_PRIV22_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV22_Pos)         /*!< 0x00400000 */
#define EXTI1_PRIVCFGR1_PRIV22     EXTI1_PRIVCFGR1_PRIV22_Msk                   /*!< SEC/PRIV enable on event input 22 */
#define EXTI1_PRIVCFGR1_PRIV23_Pos (23U)
#define EXTI1_PRIVCFGR1_PRIV23_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV23_Pos)         /*!< 0x00800000 */
#define EXTI1_PRIVCFGR1_PRIV23     EXTI1_PRIVCFGR1_PRIV23_Msk                   /*!< SEC/PRIV enable on event input 23 */
#define EXTI1_PRIVCFGR1_PRIV24_Pos (24U)
#define EXTI1_PRIVCFGR1_PRIV24_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV24_Pos)         /*!< 0x01000000 */
#define EXTI1_PRIVCFGR1_PRIV24     EXTI1_PRIVCFGR1_PRIV24_Msk                   /*!< SEC/PRIV enable on event input 24 */
#define EXTI1_PRIVCFGR1_PRIV25_Pos (25U)
#define EXTI1_PRIVCFGR1_PRIV25_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV25_Pos)         /*!< 0x02000000 */
#define EXTI1_PRIVCFGR1_PRIV25     EXTI1_PRIVCFGR1_PRIV25_Msk                   /*!< SEC/PRIV enable on event input 25 */
#define EXTI1_PRIVCFGR1_PRIV26_Pos (26U)
#define EXTI1_PRIVCFGR1_PRIV26_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV26_Pos)         /*!< 0x04000000 */
#define EXTI1_PRIVCFGR1_PRIV26     EXTI1_PRIVCFGR1_PRIV26_Msk                   /*!< SEC/PRIV enable on event input 26 */
#define EXTI1_PRIVCFGR1_PRIV27_Pos (27U)
#define EXTI1_PRIVCFGR1_PRIV27_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV27_Pos)         /*!< 0x08000000 */
#define EXTI1_PRIVCFGR1_PRIV27     EXTI1_PRIVCFGR1_PRIV27_Msk                   /*!< SEC/PRIV enable on event input 27 */
#define EXTI1_PRIVCFGR1_PRIV28_Pos (28U)
#define EXTI1_PRIVCFGR1_PRIV28_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV28_Pos)         /*!< 0x10000000 */
#define EXTI1_PRIVCFGR1_PRIV28     EXTI1_PRIVCFGR1_PRIV28_Msk                   /*!< SEC/PRIV enable on event input 28 */
#define EXTI1_PRIVCFGR1_PRIV29_Pos (29U)
#define EXTI1_PRIVCFGR1_PRIV29_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV29_Pos)         /*!< 0x20000000 */
#define EXTI1_PRIVCFGR1_PRIV29     EXTI1_PRIVCFGR1_PRIV29_Msk                   /*!< SEC/PRIV enable on event input 29 */
#define EXTI1_PRIVCFGR1_PRIV30_Pos (30U)
#define EXTI1_PRIVCFGR1_PRIV30_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV30_Pos)         /*!< 0x40000000 */
#define EXTI1_PRIVCFGR1_PRIV30     EXTI1_PRIVCFGR1_PRIV30_Msk                   /*!< SEC/PRIV enable on event input 30 */
#define EXTI1_PRIVCFGR1_PRIV31_Pos (31U)
#define EXTI1_PRIVCFGR1_PRIV31_Msk (0x1UL << EXTI1_PRIVCFGR1_PRIV31_Pos)         /*!< 0x80000000 */
#define EXTI1_PRIVCFGR1_PRIV31     EXTI1_PRIVCFGR1_PRIV31_Msk                   /*!< SEC/PRIV enable on event input 31 */

/******************  Bit definition for EXTI1_RTSR2 register  *******************/
#define EXTI1_RTSR2_RT43_Pos        (11U)
#define EXTI1_RTSR2_RT43_Msk        (0x1UL << EXTI1_RTSR2_RT43_Pos)               /*!< 0x00000800 */
#define EXTI1_RTSR2_RT43            EXTI1_RTSR2_RT43_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI1_RTSR2_RT44_Pos        (12U)
#define EXTI1_RTSR2_RT44_Msk        (0x1UL << EXTI1_RTSR2_RT44_Pos)               /*!< 0x00001000 */
#define EXTI1_RTSR2_RT44            EXTI1_RTSR2_RT44_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI1_RTSR2_RT45_Pos        (13U)
#define EXTI1_RTSR2_RT45_Msk        (0x1UL << EXTI1_RTSR2_RT45_Pos)               /*!< 0x00002000 */
#define EXTI1_RTSR2_RT45            EXTI1_RTSR2_RT45_Msk                         /*!< Rising trigger event configuration bit of line 51 */

/******************  Bit definition for EXTI1_FTSR2 register  *******************/
#define EXTI1_FTSR2_FT43_Pos        (11U)
#define EXTI1_FTSR2_FT43_Msk        (0x1UL << EXTI1_FTSR2_FT43_Pos)               /*!< 0x00000800 */
#define EXTI1_FTSR2_FT43            EXTI1_FTSR2_FT43_Msk                         /*!< Rising trigger event configuration bit of line 49 */
#define EXTI1_FTSR2_FT44_Pos        (12U)
#define EXTI1_FTSR2_FT44_Msk        (0x1UL << EXTI1_FTSR2_FT44_Pos)               /*!< 0x00001000 */
#define EXTI1_FTSR2_FT44            EXTI1_FTSR2_FT44_Msk                         /*!< Rising trigger event configuration bit of line 51 */
#define EXTI1_FTSR2_FT45_Pos        (13U)
#define EXTI1_FTSR2_FT45_Msk        (0x1UL << EXTI1_FTSR2_FT45_Pos)               /*!< 0x00002000 */
#define EXTI1_FTSR2_FT45            EXTI1_FTSR2_FT45_Msk                         /*!< Rising trigger event configuration bit of line 51 */

