zephyrproject-rtos/hal_stm32/stm32cube/stm32mp2xx/soc/stm32mp211dxx_cm33.h
/****************  Bit definition for SYSCFG_VDDCCCR register  ****************/
#define SYSCFG_VDDCCCR_RANSRC_Pos                                     (0U)
#define SYSCFG_VDDCCCR_RANSRC_Msk                                     (0xFUL << SYSCFG_VDDCCCR_RANSRC_Pos)                                       /*!< 0x0000000F */
#define SYSCFG_VDDCCCR_RANSRC                                         SYSCFG_VDDCCCR_RANSRC_Msk                                                 /*!< NMOS compensation code of the I/Os supplied by VDD */
#define SYSCFG_VDDCCCR_RAPSRC_Pos                                     (4U)
#define SYSCFG_VDDCCCR_RAPSRC_Msk                                     (0xFUL << SYSCFG_VDDCCCR_RAPSRC_Pos)                                       /*!< 0x000000F0 */
#define SYSCFG_VDDCCCR_RAPSRC                                         SYSCFG_VDDCCCR_RAPSRC_Msk                                                 /*!< PMOS compensation code of the I/Os supplied by VDD */
#define SYSCFG_VDDCCCR_EN_Pos                                         (8U)
#define SYSCFG_VDDCCCR_EN_Msk                                         (0x1UL << SYSCFG_VDDCCCR_EN_Pos)                                           /*!< 0x00000100 */
#define SYSCFG_VDDCCCR_EN                                             SYSCFG_VDDCCCR_EN_Msk                                                     /*!< VDD I/O compensation cell enable */
#define SYSCFG_VDDCCCR_CS_Pos                                         (9U)
#define SYSCFG_VDDCCCR_CS_Msk                                         (0x1UL << SYSCFG_VDDCCCR_CS_Pos)                                           /*!< 0x00000200 */
#define SYSCFG_VDDCCCR_CS                                             SYSCFG_VDDCCCR_CS_Msk                                                     /*!< VDD I/O code selection */
#define SYSCFG_VDDCCCR_LPMDIS_Pos                                     (10U)
#define SYSCFG_VDDCCCR_LPMDIS_Msk                                     (0x1UL << SYSCFG_VDDCCCR_LPMDIS_Pos)                                       /*!< 0x00000400 */
#define SYSCFG_VDDCCCR_LPMDIS                                         SYSCFG_VDDCCCR_LPMDIS_Msk                                                 /*!< VDD I/Os Compensation cell low power mode disable */

/****************  Bit definition for SYSCFG_VDDCCSR register  ****************/
#define SYSCFG_VDDCCSR_ANSRC_Pos                                      (0U)
#define SYSCFG_VDDCCSR_ANSRC_Msk                                      (0xFUL << SYSCFG_VDDCCSR_ANSRC_Pos)                                        /*!< 0x0000000F */
#define SYSCFG_VDDCCSR_ANSRC                                          SYSCFG_VDDCCSR_ANSRC_Msk                                                  /*!< NMOS compensation value of the I/Os supplied by VDD */
#define SYSCFG_VDDCCSR_APSRC_Pos                                      (4U)
#define SYSCFG_VDDCCSR_APSRC_Msk                                      (0xFUL << SYSCFG_VDDCCSR_APSRC_Pos)                                        /*!< 0x000000F0 */
#define SYSCFG_VDDCCSR_APSRC                                          SYSCFG_VDDCCSR_APSRC_Msk                                                  /*!< PMOS compensation value of the I/Os supplied by VDD */
#define SYSCFG_VDDCCSR_READY_Pos                                      (8U)
#define SYSCFG_VDDCCSR_READY_Msk                                      (0x1UL << SYSCFG_VDDCCSR_READY_Pos)                                        /*!< 0x00000100 */
#define SYSCFG_VDDCCSR_READY                                          SYSCFG_VDDCCSR_READY_Msk                                                  /*!< VDD I/O compensation cell ready flag */

/**************  Bit definition for SYSCFG_VDDIO2CCCR register  ***************/
#define SYSCFG_VDDIO2CCCR_RANSRC_Pos                                  (0U)
#define SYSCFG_VDDIO2CCCR_RANSRC_Msk                                  (0xFUL << SYSCFG_VDDIO2CCCR_RANSRC_Pos)                                    /*!< 0x0000000F */
#define SYSCFG_VDDIO2CCCR_RANSRC                                      SYSCFG_VDDIO2CCCR_RANSRC_Msk                                              /*!< NMOS compensation code of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCCR_RAPSRC_Pos                                  (4U)
#define SYSCFG_VDDIO2CCCR_RAPSRC_Msk                                  (0xFUL << SYSCFG_VDDIO2CCCR_RAPSRC_Pos)                                    /*!< 0x000000F0 */
#define SYSCFG_VDDIO2CCCR_RAPSRC                                      SYSCFG_VDDIO2CCCR_RAPSRC_Msk                                              /*!< PMOS compensation code of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCCR_EN_Pos                                      (8U)
#define SYSCFG_VDDIO2CCCR_EN_Msk                                      (0x1UL << SYSCFG_VDDIO2CCCR_EN_Pos)                                        /*!< 0x00000100 */
#define SYSCFG_VDDIO2CCCR_EN                                          SYSCFG_VDDIO2CCCR_EN_Msk                                                  /*!< VDDIO2 I/O compensation cell enable */
#define SYSCFG_VDDIO2CCCR_CS_Pos                                      (9U)
#define SYSCFG_VDDIO2CCCR_CS_Msk                                      (0x1UL << SYSCFG_VDDIO2CCCR_CS_Pos)                                        /*!< 0x00000200 */
#define SYSCFG_VDDIO2CCCR_CS                                          SYSCFG_VDDIO2CCCR_CS_Msk                                                  /*!< VDDIO2 I/O code selection */
#define SYSCFG_VDDIO2CCCR_LPMDIS_Pos                                  (10U)
#define SYSCFG_VDDIO2CCCR_LPMDIS_Msk                                  (0x1UL << SYSCFG_VDDIO2CCCR_LPMDIS_Pos)                                    /*!< 0x00000400 */
#define SYSCFG_VDDIO2CCCR_LPMDIS                                      SYSCFG_VDDIO2CCCR_LPMDIS_Msk                                              /*!< VDDIO2 I/Os Compensation cell low power mode disable */

/**************  Bit definition for SYSCFG_VDDIO2CCSR register  ***************/
#define SYSCFG_VDDIO2CCSR_ANSRC_Pos                                   (0U)
#define SYSCFG_VDDIO2CCSR_ANSRC_Msk                                   (0xFUL << SYSCFG_VDDIO2CCSR_ANSRC_Pos)                                     /*!< 0x0000000F */
#define SYSCFG_VDDIO2CCSR_ANSRC                                       SYSCFG_VDDIO2CCSR_ANSRC_Msk                                               /*!< NMOS compensation value of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCSR_APSRC_Pos                                   (4U)
#define SYSCFG_VDDIO2CCSR_APSRC_Msk                                   (0xFUL << SYSCFG_VDDIO2CCSR_APSRC_Pos)                                     /*!< 0x000000F0 */
#define SYSCFG_VDDIO2CCSR_APSRC                                       SYSCFG_VDDIO2CCSR_APSRC_Msk                                               /*!< PMOS compensation value of the I/Os supplied by VDDIO2 */
#define SYSCFG_VDDIO2CCSR_READY_Pos                                   (8U)
#define SYSCFG_VDDIO2CCSR_READY_Msk                                   (0x1UL << SYSCFG_VDDIO2CCSR_READY_Pos)                                     /*!< 0x00000100 */
#define SYSCFG_VDDIO2CCSR_READY                                       SYSCFG_VDDIO2CCSR_READY_Msk                                               /*!< VDDIO2 I/O compensation cell ready flag */

/**************  Bit definition for SYSCFG_VDDIO1CCCR register  ***************/
#define SYSCFG_VDDIO1CCCR_RANSRC_Pos                                  (0U)
#define SYSCFG_VDDIO1CCCR_RANSRC_Msk                                  (0xFUL << SYSCFG_VDDIO1CCCR_RANSRC_Pos)                                    /*!< 0x0000000F */
#define SYSCFG_VDDIO1CCCR_RANSRC                                      SYSCFG_VDDIO1CCCR_RANSRC_Msk                                              /*!< NMOS compensation code of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCCR_RAPSRC_Pos                                  (4U)
#define SYSCFG_VDDIO1CCCR_RAPSRC_Msk                                  (0xFUL << SYSCFG_VDDIO1CCCR_RAPSRC_Pos)                                    /*!< 0x000000F0 */
#define SYSCFG_VDDIO1CCCR_RAPSRC                                      SYSCFG_VDDIO1CCCR_RAPSRC_Msk                                              /*!< PMOS compensation code of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCCR_EN_Pos                                      (8U)
#define SYSCFG_VDDIO1CCCR_EN_Msk                                      (0x1UL << SYSCFG_VDDIO1CCCR_EN_Pos)                                        /*!< 0x00000100 */
#define SYSCFG_VDDIO1CCCR_EN                                          SYSCFG_VDDIO1CCCR_EN_Msk                                                  /*!< VDDIO1 I/O compensation cell enable */
#define SYSCFG_VDDIO1CCCR_CS_Pos                                      (9U)
#define SYSCFG_VDDIO1CCCR_CS_Msk                                      (0x1UL << SYSCFG_VDDIO1CCCR_CS_Pos)                                        /*!< 0x00000200 */
#define SYSCFG_VDDIO1CCCR_CS                                          SYSCFG_VDDIO1CCCR_CS_Msk                                                  /*!< VDDIO1 I/O code selection */
#define SYSCFG_VDDIO1CCCR_LPMDIS_Pos                                  (10U)
#define SYSCFG_VDDIO1CCCR_LPMDIS_Msk                                  (0x1UL << SYSCFG_VDDIO1CCCR_LPMDIS_Pos)                                    /*!< 0x00000400 */
#define SYSCFG_VDDIO1CCCR_LPMDIS                                      SYSCFG_VDDIO1CCCR_LPMDIS_Msk                                              /*!< VDDIO1 I/Os Compensation cell low power mode disable */

/**************  Bit definition for SYSCFG_VDDIO1CCSR register  ***************/
#define SYSCFG_VDDIO1CCSR_ANSRC_Pos                                   (0U)
#define SYSCFG_VDDIO1CCSR_ANSRC_Msk                                   (0xFUL << SYSCFG_VDDIO1CCSR_ANSRC_Pos)                                     /*!< 0x0000000F */
#define SYSCFG_VDDIO1CCSR_ANSRC                                       SYSCFG_VDDIO1CCSR_ANSRC_Msk                                               /*!< NMOS compensation value of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCSR_APSRC_Pos                                   (4U)
#define SYSCFG_VDDIO1CCSR_APSRC_Msk                                   (0xFUL << SYSCFG_VDDIO1CCSR_APSRC_Pos)                                     /*!< 0x000000F0 */
#define SYSCFG_VDDIO1CCSR_APSRC                                       SYSCFG_VDDIO1CCSR_APSRC_Msk                                               /*!< PMOS compensation value of the I/Os supplied by VDDIO1 */
#define SYSCFG_VDDIO1CCSR_READY_Pos                                   (8U)
#define SYSCFG_VDDIO1CCSR_READY_Msk                                   (0x1UL << SYSCFG_VDDIO1CCSR_READY_Pos)                                     /*!< 0x00000100 */
#define SYSCFG_VDDIO1CCSR_READY                                       SYSCFG_VDDIO1CCSR_READY_Msk                                               /*!< VDDIO1 I/O compensation cell ready flag */

